app/views/dashboard/index.html.erb

                <%= link_to "Edit my space", edit_space_path(space.id), class: "btn btn-primary" %>
                <% if space.bookings.blank? %>
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."space_id" = $1  [["space_id", 61]]